chirags98/Edge_ML_STM32N6/projects/STM32CubeN6/Projects/STM32N6570-DK/Templates/Template_FSBL_XIP/Appli/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "isp_api.h"
#include "imx335_E27_isp_param_conf.h"
#include "imx335.h"
#include "stm32n6570_discovery_xspi.h"

#include "stai.h"
#include "stai_network.h"
#include "npu_cache.h"

#include "app_postprocess.h"

#include <string.h>

#include "app_config.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct {
  uint32_t X0, Y0, XSize, YSize;
} Rectangle_TypeDef;

Rectangle_TypeDef lcd_bg_area = { .X0 = 160, .Y0 = 0, .XSize = 480, .YSize = 480 };
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define CAMERA_IMX335_ADDRESS 0x34U
#define FRAME_WIDTH        640
#define FRAME_HEIGHT       480
#define FRAME_BUFFER_SIZE  (FRAME_WIDTH * FRAME_HEIGHT * 2)   /* RGB565 = 2 bytes/pixel */
#define BUFFER_ADDRESS     0x90000000UL /* PSRAM (XSPI1): Pipe 1 / LCD */

#define DIV_FACTOR(SRC, DST) (((uint32_t)((1024 * DST) / SRC)) > 1023 ? 1023 : ((uint32_t)((1024 * DST) / SRC)))
#define DOWNSCALE_RATIO(SRC, DST) (((uint32_t)(((float_t)(SRC) / (float_t)(DST)) * 8192) < 8192) ? 8192 : \
                                   ((((uint32_t)(((float_t)(SRC) / (float_t)(DST)) * 8192)) > 65535) ? 65535 : \
                                   ((uint32_t)(((float_t)(SRC) / (float_t)(DST)) * 8192))))

#define NN_INPUT_WIDTH   128
#define NN_INPUT_HEIGHT  128
#define NN_INPUT_CH      3
#define NN_INPUT_SIZE    (NN_INPUT_WIDTH * NN_INPUT_HEIGHT * NN_INPUT_CH)  /* 49152 */

#define LCD_FG_WIDTH   800
#define LCD_FG_HEIGHT  480
#define LCD_FG_ADDRESS 0x90100000UL
#define LCD_FG_SIZE    (LCD_FG_WIDTH * LCD_FG_HEIGHT * 2)  /* ARGB4444 */

#define CIRCLE_RADIUS 3
#define ARGB4444_GREEN  0xF0F0  /* opaque green  */
#define ARGB4444_YELLOW 0xFFF0  /* opaque yellow */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

DCMIPP_HandleTypeDef hdcmipp;

I2C_HandleTypeDef hi2c1;

LTDC_HandleTypeDef hltdc;

RAMCFG_HandleTypeDef hramcfg_SRAM4;
RAMCFG_HandleTypeDef hramcfg_SRAM5;

XSPI_HandleTypeDef hxspi1;

/* USER CODE BEGIN PV */
static IMX335_Object_t IMX335Obj;
static int32_t isp_gain;
static int32_t isp_exposure;
ISP_HandleTypeDef hcamera_isp;

volatile uint32_t dbg_frame_count;
volatile uint32_t dbg_vsync_count;

volatile int32_t  dbg_readid_ret;
volatile uint32_t dbg_id;
volatile int32_t  dbg_imx335_init_ret;
volatile int32_t  dbg_setfreq_ret;
volatile int32_t  dbg_isp_init_ret;
volatile int32_t  dbg_pipe_start_ret;
volatile uint32_t dbg_i2c_err;

__attribute__((aligned(32)))
//static uint8_t nn_input_buffer[NN_INPUT_SIZE];
volatile uint32_t pipe2_frame_ready;
volatile uint32_t dbg_pipe2_frame_count;
volatile int32_t  dbg_pipe2_start_ret;

STAI_NETWORK_CONTEXT_DECLARE(network_context, STAI_NETWORK_CONTEXT_SIZE);
stai_ptr nn_in;
stai_ptr nn_out[STAI_NETWORK_OUT_NUM];
volatile int32_t dbg_stai_rt_init;
volatile int32_t dbg_stai_net_init;

volatile int32_t  dbg_infer_ret;
volatile uint32_t dbg_infer_ms;

fd_blazeface_pp_static_param_t pp_params;
fd_pp_out_t pp_output;
volatile int32_t  dbg_pp_ret;
volatile uint32_t dbg_nb_detect;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_LTDC_Init(void);
static void MX_DCMIPP_Init(void);
static void MX_I2C1_Init(void);
static void MX_RAMCFG_Init(void);
static void MX_XSPI1_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
static int32_t YourI2C1_Init(void);
static int32_t YourI2C1_DeInit(void);
static int32_t YourI2C1_WriteReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t YourI2C1_ReadReg16(uint16_t DevAddr, uint16_t Reg, uint8_t *pData, uint16_t Length);
static int32_t YourI2C1_GetTick(void);

static ISP_StatusTypeDef GetSensorInfoHelper(uint32_t Instance, ISP_SensorInfoTypeDef *SensorInfo);
static ISP_StatusTypeDef SetSensorGainHelper(uint32_t Instance, int32_t Gain);
static ISP_StatusTypeDef GetSensorGainHelper(uint32_t Instance, int32_t *Gain);
static ISP_StatusTypeDef SetSensorExposureHelper(uint32_t Instance, int32_t Exposure);
static ISP_StatusTypeDef GetSensorExposureHelper(uint32_t Instance, int32_t *Exposure);
void Error_Handler(void);

static int clamp_point(int *x, int *y);
static void convert_length(float32_t wi, float32_t hi, int *wo, int *ho);
static void convert_point(float32_t xi, float32_t yi, int *xo, int *yo);
static void Display_keypoint(fd_pp_keyPoints_t *key, uint16_t color);
static void Display_Face(fd_pp_outBuffer_t *detect);
static void Display_NetworkOutput(fd_pp_out_t *p_postprocess);
static void overlay_Clear(void);
static void overlay_DrawRect(int x, int y, int w, int h, uint16_t c);
static void overlay_FillCircle(int x, int y, int r, uint16_t c);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

