chirags98/Edge_ML_STM32N6/projects/STM32CubeN6/Projects/STM32N6570-DK/Templates/Template_FSBL_XIP/Appli/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* System clock already configured, simply SystemCoreClock init */
  SystemCoreClockUpdate();
  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* Initialize LED1 */
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
  /* USER CODE END Init */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_LTDC_Init();
  MX_DCMIPP_Init();
  MX_I2C1_Init();
  MX_RAMCFG_Init();
  SystemIsolation_Config();
  /* USER CODE BEGIN 2 */

  /* PSRAM: do not call BSP_XSPI_RAM_Init() — its MSP resets XSPIM and kills XIP. */
  {
    MX_XSPI_InitTypeDef xspi_init = {0};
    volatile uint32_t *psram;

    xspi_init.ClockPrescaler = 3;
    xspi_init.MemorySize     = HAL_XSPI_SIZE_256MB;
    xspi_init.SampleShifting = HAL_XSPI_SAMPLE_SHIFT_NONE;

    if (MX_XSPI_RAM_Init(&hxspi_ram[0], &xspi_init) != HAL_OK)
    {
      Error_Handler();
    }

    (void)APS256XX_WriteReg(&hxspi_ram[0], 0, 0x30); /* read latency  */
    (void)APS256XX_WriteReg(&hxspi_ram[0], 4, 0x20); /* write latency */
    (void)APS256XX_WriteReg(&hxspi_ram[0], 8, 0x40); /* x16 mode      */
    (void)HAL_XSPI_SetClockPrescaler(&hxspi_ram[0], 0);

    if (BSP_XSPI_RAM_EnableMemoryMappedMode(0) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    psram = (volatile uint32_t *)BUFFER_ADDRESS;
    psram[0] = 0xA5A5A5A5UL;
    psram[1] = 0x5A5A5A5AUL;
    if ((psram[0] != 0xA5A5A5A5UL) || (psram[1] != 0x5A5A5A5AUL))
    {
      Error_Handler(); /* PSRAM not mapped — do not start the camera */
    }
  }

  HAL_GPIO_WritePin(NRST_GPIO_Port, NRST_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(PWR_EN_GPIO_Port, PWR_EN_Pin, GPIO_PIN_RESET);
  HAL_Delay(200);
  HAL_GPIO_WritePin(PWR_EN_GPIO_Port, PWR_EN_Pin, GPIO_PIN_SET);
  HAL_Delay(3);

  LL_MEM_EnableClock(LL_MEM_AXISRAM4);
  LL_MEM_EnableClock(LL_MEM_AXISRAM5);
  HAL_RAMCFG_EnableAXISRAM(&hramcfg_SRAM4);
  HAL_RAMCFG_EnableAXISRAM(&hramcfg_SRAM5);

  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  npu_cache_enable();   /* CACHEAXI already inited by MX_; this just enables it */

  dbg_stai_rt_init  = stai_runtime_init();
  dbg_stai_net_init = stai_network_init(network_context);
  if (dbg_stai_net_init != STAI_SUCCESS)
  {
    Error_Handler();
  }

  stai_size n_in = 1;
  stai_network_get_inputs(network_context, &nn_in, &n_in);

  stai_network_info info;
  stai_size n_out = STAI_NETWORK_OUT_NUM;
  int32_t nn_out_len[STAI_NETWORK_OUT_NUM];

  stai_network_get_info(network_context, &info);
  stai_network_get_outputs(network_context, nn_out, &n_out);

  dbg_pp_ret = app_postprocess_init(&pp_params, &info);
  if (dbg_pp_ret != 0)
  {
    Error_Handler();
  }

  for (int i = 0; i < (int)n_out; i++)
    nn_out_len[i] = info.outputs[i].size_bytes;

  DCMIPP_DownsizeTypeDef DownsizeConf = {0};
  DownsizeConf.HSize      = FRAME_WIDTH;
  DownsizeConf.VSize      = FRAME_HEIGHT;
  DownsizeConf.HRatio     = DOWNSCALE_RATIO(IMX335_WIDTH, FRAME_WIDTH);
  DownsizeConf.VRatio     = DOWNSCALE_RATIO(IMX335_HEIGHT, FRAME_HEIGHT);
  DownsizeConf.HDivFactor = DIV_FACTOR(IMX335_WIDTH, FRAME_WIDTH);
  DownsizeConf.VDivFactor = DIV_FACTOR(IMX335_HEIGHT, FRAME_HEIGHT);
  HAL_DCMIPP_PIPE_SetDownsizeConfig(&hdcmipp, DCMIPP_PIPE1, &DownsizeConf);
  HAL_DCMIPP_PIPE_EnableDownsize(&hdcmipp, DCMIPP_PIPE1);

  /* Pipe 2: centre-crop a square, then decimate, then downsize.
     The scaler only goes to ~8x; 2592→128 is ~20x so decimation is required.
     Without that, Pipe 2 just dumps the top-left 128×128 of the sensor. */
  {
    DCMIPP_CropConfTypeDef crop = {0};
    DCMIPP_DecimationConfTypeDef dec = {0};
    DCMIPP_DownsizeTypeDef down = {0};
    const uint32_t side = (IMX335_WIDTH < IMX335_HEIGHT) ? IMX335_WIDTH : IMX335_HEIGHT; /* 1944 */
    const uint32_t after_dec = side / 2; /* 972 after 1-out-of-2 */

    crop.HSize    = side;
    crop.VSize    = side;
    crop.HStart   = (IMX335_WIDTH  - side) / 2;
    crop.VStart   = (IMX335_HEIGHT - side) / 2;
    crop.PipeArea = DCMIPP_POSITIVE_AREA;
    HAL_DCMIPP_PIPE_SetCropConfig(&hdcmipp, DCMIPP_PIPE2, &crop);
    HAL_DCMIPP_PIPE_EnableCrop(&hdcmipp, DCMIPP_PIPE2);

    dec.HRatio = DCMIPP_HDEC_1_OUT_2;
    dec.VRatio = DCMIPP_VDEC_1_OUT_2;
    HAL_DCMIPP_PIPE_SetDecimationConfig(&hdcmipp, DCMIPP_PIPE2, &dec);
    HAL_DCMIPP_PIPE_EnableDecimation(&hdcmipp, DCMIPP_PIPE2);

    down.HSize      = NN_INPUT_WIDTH;
    down.VSize      = NN_INPUT_HEIGHT;
    down.HRatio     = DOWNSCALE_RATIO(after_dec, NN_INPUT_WIDTH);
    down.VRatio     = DOWNSCALE_RATIO(after_dec, NN_INPUT_HEIGHT);
    down.HDivFactor = DIV_FACTOR(after_dec, NN_INPUT_WIDTH);
    down.VDivFactor = DIV_FACTOR(after_dec, NN_INPUT_HEIGHT);
    HAL_DCMIPP_PIPE_SetDownsizeConfig(&hdcmipp, DCMIPP_PIPE2, &down);
    HAL_DCMIPP_PIPE_EnableDownsize(&hdcmipp, DCMIPP_PIPE2);
    HAL_DCMIPP_PIPE_EnableRedBlueSwap(&hdcmipp, DCMIPP_PIPE2);
  }

  HAL_GPIO_WritePin(LCD_ON_OFF_GPIO_Port, LCD_ON_OFF_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_Port, LCD_BL_CTRL_Pin, GPIO_PIN_SET);

  IMX335_IO_t IOCtx;
  IOCtx.Address  = CAMERA_IMX335_ADDRESS;
  IOCtx.Init     = YourI2C1_Init;     /* can just be a no-op, since MX_I2C1_Init() already ran */
  IOCtx.DeInit   = YourI2C1_DeInit;
  IOCtx.ReadReg  = YourI2C1_ReadReg16;
  IOCtx.WriteReg = YourI2C1_WriteReg16;
  IOCtx.GetTick  = YourI2C1_GetTick;

  uint32_t id;
  IMX335_RegisterBusIO(&IMX335Obj, &IOCtx);
  dbg_readid_ret      = IMX335_ReadID(&IMX335Obj, &id);                 /* check id == IMX335_CHIP_ID */
  dbg_id              = id;
  dbg_i2c_err         = HAL_I2C_GetError(&hi2c1);
  dbg_imx335_init_ret = IMX335_Init(&IMX335Obj, IMX335_R2592_1944, IMX335_RAW_RGGB10);
  dbg_setfreq_ret     = IMX335_SetFrequency(&IMX335Obj, IMX335_INCK_24MHZ);

  HAL_LTDC_SetAddress(&hltdc, BUFFER_ADDRESS, 0);

