chirags98/Edge_ML_STM32N6/projects/STM32CubeN6/Projects/STM32N6570-DK/Templates/Template_FSBL_XIP/Appli/Src/main.c
static void convert_point(float32_t xi, float32_t yi, int *xo, int *yo)
{
  *xo = lcd_bg_area.XSize * xi + lcd_bg_area.X0;
  *yo = lcd_bg_area.YSize * yi + lcd_bg_area.Y0;
}

void Display_Face(fd_pp_outBuffer_t *detect)
{
  int xc, yc, x0, y0, x1, y1, w, h, i;

  convert_point(detect->x_center, detect->y_center, &xc, &yc);
  convert_length(detect->width, detect->height, &w, &h);
  x0 = xc - (w + 1) / 2;
  y0 = yc - (h + 1) / 2;
  x1 = xc + (w + 1) / 2;
  y1 = yc + (h + 1) / 2;
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);

  overlay_DrawRect(x0, y0, x1 - x0, y1 - y0, ARGB4444_GREEN);

  for (i = 0; i < AI_FD_BLAZEFACE_PP_NB_KEYPOINTS; i++)
    Display_keypoint(&detect->pKeyPoints[i], ARGB4444_YELLOW);
}

static void Display_NetworkOutput(fd_pp_out_t *p_postprocess)
{
  overlay_Clear();   /* fill 800×480 with 0x0000 */
  for (int32_t i = 0; i < p_postprocess->nb_detect; i++)
    Display_Face(&p_postprocess->pOutBuff[i]);
}

static uint16_t *fg(void) { return (uint16_t *)LCD_FG_ADDRESS; }

static void overlay_Clear(void)
{
  memset((void *)LCD_FG_ADDRESS, 0, LCD_FG_SIZE);
}

static void overlay_DrawRect(int x, int y, int w, int h, uint16_t c)
{
  uint16_t *p = fg();
  int i;
  if (w <= 0 || h <= 0) return;
  for (i = 0; i < w; i++) {
    p[y * LCD_FG_WIDTH + x + i] = c;
    p[(y + h - 1) * LCD_FG_WIDTH + x + i] = c;
  }
  for (i = 0; i < h; i++) {
    p[(y + i) * LCD_FG_WIDTH + x] = c;
    p[(y + i) * LCD_FG_WIDTH + x + w - 1] = c;
  }
}

static void overlay_FillCircle(int x, int y, int r, uint16_t c)
{
  uint16_t *p = fg();
  int dx, dy;
  int r2 = r * r;

  for (dy = -r; dy <= r; dy++)
  {
    int py = y + dy;
    if (py < 0 || py >= LCD_FG_HEIGHT)
      continue;
    for (dx = -r; dx <= r; dx++)
    {
      int px = x + dx;
      if (px < 0 || px >= LCD_FG_WIDTH)
        continue;
      if (dx * dx + dy * dy <= r2)
        p[py * LCD_FG_WIDTH + px] = c;
    }
  }
}

static void Display_keypoint(fd_pp_keyPoints_t *key, uint16_t color)
{
  int is_clamp;
  int xc, yc;
  int x, y;

  convert_point(key->x, key->y, &x, &y);
  xc = x - CIRCLE_RADIUS / 2;
  yc = y - CIRCLE_RADIUS / 2;
  is_clamp = clamp_point(&xc, &yc);
  xc = x + CIRCLE_RADIUS / 2;
  yc = y + CIRCLE_RADIUS / 2;
  is_clamp |= clamp_point(&xc, &yc);

  if (is_clamp)
    return;

  overlay_FillCircle(x, y, CIRCLE_RADIUS, color);
}
/* USER CODE END 4 */

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};
  MPU_Attributes_InitTypeDef MPU_AttributesInit = {0};
  uint32_t primask_bit = __get_PRIMASK();
  __disable_irq();

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region 0 and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = __NON_CACHEABLE_SECTION_BEGIN;
  MPU_InitStruct.LimitAddress = __NON_CACHEABLE_SECTION_END;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region 1 and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x90000000;
  MPU_InitStruct.LimitAddress = 0x91FFFFFF ;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Attribute 0 and the memory to be protected
  */
  MPU_AttributesInit.Number = MPU_ATTRIBUTES_NUMBER0;
  MPU_AttributesInit.Attributes = INNER_OUTER(MPU_NOT_CACHEABLE);

  HAL_MPU_ConfigMemoryAttributes(&MPU_AttributesInit);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_HFNMI_PRIVDEF);

  /* Exit critical section to lock the system and avoid any issue around MPU mechanism */
  __set_PRIMASK(primask_bit);

}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
